package ru.example.docmanager.ui.components

enum class DropdownMode {
    /**
     * Пользователь может только выбрать значение из списка.
     * Ручной ввод запрещен.
     */
    VALUES_ONLY,

    /**
     * Пользователь может:
     * - выбрать значение из списка
     * - ввести любое произвольное значение.
     */
    VALUES_AND_INPUT,

    /**
     * Пользователь может печатать для поиска,
     * но итоговое значение обязано быть одним из `items`.
     *
     * То есть:
     * `draft != committedValue`
     * пока пользователь печатает,
     * но `onValueChange` вызывается только для валидного значения.
     */
    STRICT_VALUES_AND_INPUT,
}